spec/dummy/app/controllers/restaurants_controller.rb

  def create
    @restaurant = Restaurant.new(restaurant_params)

    if @restaurant.save
---
INSERT INTO "restaurants" ("name", "city", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Butcher"], ["city", "SP"], ["created_at", "2020-12-01 09:56:41.902887"], ["updated_at", "2020-12-01 09:56:41.902887"]]